_org_posts/_posts/2022-01-09-abc234-e-upsolving.org
#+HTML: ---
#+HTML: title: abc234 E - Arithmetic Number
#+HTML: tags: AtCoder 수학
#+HTML: ---
#+OPTIONS: ^:nil

** E - Arithmetic Number

** 접근하기
- 주어진 조건을 이용해서 sort된 수열을 만든다. - STL set 이용
  - set에 넣으면, 정렬된 순서로 들어감
- Find the smallest arithmetic number not less than X -> lower_bound 이용
  - set에서 lower_bound 함수를 제공

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;
typedef long long ll;

ll X;
set<ll> sp;
int main(int argc, char* argv[])
{
    scanf("%lld", &X);    
    
    for(int s=1;s<=9;s++) {
        sp.insert(s);

        for(int d=-9;d<=9;d++) {
            ll val = s;
            int num = s;
            while(val<1e18) {
                num += d;
                if (num < 0 || num > 9) break;
                val = val * 10 + num; 
                sp.insert(val);
            }

        }
    }
    printf("%lld\n", (*sp.lower_bound(X)));
    return 0;
}
#+END_SRC

** 문제 링크
- https://atcoder.jp/contests/abc234/tasks/abc234_e
