_posts/2022-01-09-abc234-e-upsolving.html
---
title: abc234 E - Arithmetic Number
tags: AtCoder 수학
---

<div id="outline-container-org09553c9" class="outline-2">
<h2 id="org09553c9">E - Arithmetic Number</h2>
</div>

<div id="outline-container-org8f0b169" class="outline-2">
<h2 id="org8f0b169">접근하기</h2>
<div class="outline-text-2" id="text-org8f0b169">
<ul class="org-ul">
<li>주어진 조건을 이용해서 sort된 수열을 만든다. - STL set 이용
<ul class="org-ul">
<li>set에 넣으면, 정렬된 순서로 들어감</li>
</ul></li>
<li>Find the smallest arithmetic number not less than X -&gt; lower_bound 이용
<ul class="org-ul">
<li>set에서 lower_bound 함수를 제공</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org480cd2d" class="outline-2">
<h2 id="org480cd2d">코드</h2>
<div class="outline-text-2" id="text-org480cd2d">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">X</span>;
<span style="color: #8ae234; font-weight: bold;">set</span>&lt;<span style="color: #8ae234; font-weight: bold;">ll</span>&gt; <span style="color: #ff6347;">sp</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld"</span>, &amp;X);    

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>=1;s&lt;=9;s++) {
        sp.insert(s);

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">d</span>=-9;d&lt;=9;d++) {
            <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">val</span> = s;
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span> = s;
            <span style="color: #729fcf; font-weight: bold;">while</span>(val&lt;1e18) {
                num += d;
                <span style="color: #729fcf; font-weight: bold;">if</span> (<span style="color: #8ae234; font-weight: bold;">num</span> &lt; 0 || num &gt; 9) <span style="color: #729fcf; font-weight: bold;">break</span>;
                val = val * 10 + num; 
                sp.insert(val);
            }

        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, (*sp.lower_bound(X)));
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org93eaa0b" class="outline-2">
<h2 id="org93eaa0b">문제 링크</h2>
<div class="outline-text-2" id="text-org93eaa0b">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc234/tasks/abc234_e">https://atcoder.jp/contests/abc234/tasks/abc234_e</a></li>
</ul>
</div>
</div>
